package ru.jjd.base.school;

public class main {
    public static void main(String[] args) {

    }
    //когда будет вызываться метод школьный день - учителя учат учеников, если у них совпадают предметы,
    //школа не может быть без директора
    //если несколько учителей по одному предмету - можно между ними не разбивать
    //уровень знаний - инт
    //метод учиться - должен быть реализован как повышение их уровня знаний, просто повышение
    //у учителя метод учить, тип данных выбрать самостоятельно, в него передается ученик, внутри него вызывается метод
    //повышения знаний
    //возможно расширение программы, поэтому методы учиться и учить обязательно выносить в отдельный интерфейс
    //хорошо подумать над типом данных учить(интерфейс)
    //задачу можно усложнять по желанию
    //школьный день - объявление начала занятий, потом перебор массивов для учебы, потом объявление окончания занятий
    //предмет можно вынести в отдельный класс
    //один директор - приватный конструктор, статическая переменна, если переменная пустая - создавать директора
}
